* mypackage install
#+BEGIN_SRC emacs-lisp

(defvar mypackages
  '(session
    dashboard
    projectile
    counsel-projectile
    neotree
    emmet-mode
    highlight-parentheses
  ))

(mapc #'(lambda (package)
    (unless (package-installed-p package)
      (package-install package)))
      mypackages)

(defconst private-dir  (expand-file-name "private" user-emacs-directory))
(defconst temp-dir (format "%s/cache" private-dir)
  "Hostname-based elisp temp directories")


  (use-package try
    :ensure t)


  (defun load-if-exists (f)
    "load the elisp file only if it exists and is readable"
    (if (file-readable-p f)
	(load-file f)))

  (load-if-exists "~/Documents/el/auto-save.el")
  (load-if-exists "~/Documents/el/tmp-test.el")

#+END_SRC

#+RESULTS:
| session | dashboard |

* ibuffer bbbb nnnn
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-x C-b") 'ibuffer)
 (setq ibuffer-saved-filter-groups
       (quote (("default"
                ("dired" (mode . dired-mode))
                ("org" (mode . org-mode))
                ("emacs" (or
                          (name . "^\\*scratch\\*$")
                          (name . "^\\*Messages\\*$")
                          (name . "^\\*Backtrace\\*$")
                          (name . "^\\*dashboard\\*$")))
                ))))
 (add-hook 'ibuffer-mode-hook
           (lambda ()
             (ibuffer-switch-to-saved-filter-groups "default")))

#+END_SRC

#+RESULTS:
| lambda | nil | (ibuffer-switch-to-saved-filter-groups default) |

